Requirement already satisfied: psycopg2 in c:\users\khans\anaconda3\envs\pythondata\lib\site-packages (2.9.5)Note: you may need to restart the kernel to use updated packages.

In [2]:
# import dependencies
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import inspect

In [3]:
# Load and read weekly earnings data file, store into pandas dataframe, look at head
# 1. Weekly 
weekly_earnings_csv = pd.read_csv("Resources/weekly_earnings.csv")
weekly_earnings_df = pd.DataFrame(weekly_earnings_csv)
weekly_earnings_df.head(10)

,Unnamed: 0,Earnings; Males; Full Time; Adult; Ordinary time earnings ; Western Australia ;,Earnings; Males; Full Time; Adult; Total earnings ; Western Australia ;,Earnings; Males; Total earnings ; Western Australia ;,Earnings; Females; Full Time; Adult; Ordinary time earnings ; Western Australia ;,Earnings; Females; Full Time; Adult; Total earnings ; Western Australia ;,Earnings; Females; Total earnings ; Western Australia ;,Earnings; Persons; Full Time; Adult; Ordinary time earnings ; Western Australia ;,Earnings; Persons; Full Time; Adult; Total earnings ; Western Australia ;,Earnings; Persons; Total earnings ; Western Australia ;
0,Unit,$,$,$,$,$,$,$,$,$
1,Series Type,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted,Seasonally Adjusted
2,Data Type,RATIO,RATIO,RATIO,RATIO,RATIO,RATIO,RATIO,RATIO,RATIO
3,Frequency,Biannual,Biannual,Biannual,Biannual,Biannual,Biannual,Biannual,Biannual,Biannual
4,Collection Month,2,2,2,2,2,2,2,2,2
5,Series Start,May-2012,May-2012,May-2012,May-2012,May-2012,May-2012,May-2012,May-2012,May-2012
6,Series End,May-2022,May-2022,May-2022,May-2022,May-2022,May-2022,May-2022,May-2022,May-2022
7,No. Obs,21,21,21,21,21,21,21,21,21
8,Series ID,A85002053W,A85002056C,A85002059K,A85002054X,A85002057F,A85002060V,A85002055A,A85002058J,A85002061W
9,May-2012,1659.80,1826.70,1556.10,1241.90,1266.90,834.30,1516.80,1635.20,1204.50

In [4]:
# Load and read Labour Force data file, store into pandas dataframe, look at head
#2. labour force
labour_force_csv = pd.read_csv("Resources/labour_force.csv")
labour_force_df = pd.DataFrame(labour_force_csv)
labour_force_df.head(10)

,Unnamed: 0,Employed total ; Persons ;,Employed total ; Persons ;.1,Employed total ; Persons ;.2,Employed total ; > Males ;,Employed total ; > Males ;.1,Employed total ; > Males ;.2,Employed total ; > Females ;,Employed total ; > Females ;.1,Employed total ; > Females ;.2,...,Participation rate ; > Males ;.2,Participation rate ; > Females ;,Participation rate ; > Females ;.1,Participation rate ; > Females ;.2,Not in the labour force (NILF) ; Persons ;,Not in the labour force (NILF) ; > Males ;,Not in the labour force (NILF) ; > Females ;,Civilian population aged 15 years and over ; Persons ;,Civilian population aged 15 years and over ; > Males ;,Civilian population aged 15 years and over ; > Females ;
0,Unit,000,000,000,000,000,000,000,000,000,...,Percent,Percent,Percent,Percent,000,000,000,000,000,000
1,Series Type,Trend,Seasonally Adjusted,Original,Trend,Seasonally Adjusted,Original,Trend,Seasonally Adjusted,Original,...,Original,Trend,Seasonally Adjusted,Original,Original,Original,Original,Original,Original,Original
2,Data Type,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK,...,PERCENT,PERCENT,PERCENT,PERCENT,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK
3,Frequency,Month,Month,Month,Month,Month,Month,Month,Month,Month,...,Month,Month,Month,Month,Month,Month,Month,Month,Month,Month
4,Collection Month,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
5,Series Start,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,...,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978
6,Series End,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,...,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022
7,No. Obs,537,537,537,537,537,537,537,537,537,...,537,537,537,537,537,537,537,537,537,537
8,Series ID,A84423993J,A84423321T,A84423657W,A84423881R,A84423209T,A84423545C,A84424105T,A84423433K,A84423769R,...,A84423551X,A84424111L,A84423439X,A84423775K,A84423660K,A84423548K,A84423772C,A84423661L,A84423549L,A84423773F
9,Feb-1978,529.8,524.1,522.9,341.8,342.5,344.8,188.0,181.6,178.1,...,82.2,46.7,45.7,45.6,318.3,79.4,238.9,884.2,445.3,438.9

In [5]:
# Load and read retail turnover data file, store into pandas dataframe, look at head
#3. retail turnover
retail_turnover_csv = pd.read_csv("Resources/retail_turnover.csv")
retail_turnover_df = pd.DataFrame(retail_turnover_csv)
retail_turnover_df.head(10)

,Unnamed: 0,Turnover ; New South Wales ; Total (Industry) ;,Turnover ; Victoria ; Total (Industry) ;,Turnover ; Queensland ; Total (Industry) ;,Turnover ; South Australia ; Total (Industry) ;,Turnover ; Western Australia ; Total (Industry) ;,Turnover ; Tasmania ; Total (Industry) ;,Turnover ; Northern Territory ; Total (Industry) ;,Turnover ; Australian Capital Territory ; Total (Industry) ;,Turnover ; Total (State) ; Total (Industry) ;,...,Turnover ; Total (State) ; Total (Industry) ;.1,Turnover ; New South Wales ; Total (Industry) ;.2,Turnover ; Victoria ; Total (Industry) ;.2,Turnover ; Queensland ; Total (Industry) ;.2,Turnover ; South Australia ; Total (Industry) ;.2,Turnover ; Western Australia ; Total (Industry) ;.2,Turnover ; Tasmania ; Total (Industry) ;.2,Turnover ; Northern Territory ; Total (Industry) ;.2,Turnover ; Australian Capital Territory ; Total (Industry) ;.2,Turnover ; Total (State) ; Total (Industry) ;.2
0,Unit,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,...,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions
1,Series Type,Original,Original,Original,Original,Original,Original,Original,Original,Original,...,Seasonally Adjusted,Trend,Trend,Trend,Trend,Trend,Trend,Trend,Trend,Trend
2,Data Type,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,...,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW
3,Frequency,Month,Month,Month,Month,Month,Month,Month,Month,Month,...,Month,Month,Month,Month,Month,Month,Month,Month,Month,Month
4,Collection Month,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
5,Series Start,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,...,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982
6,Series End,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,...,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022
7,No. Obs,487,487,487,487,487,487,487,487,487,...,487,487,487,487,487,487,487,487,487,487
8,Series ID,A3348645F,A3348708C,A3348771V,A3348834T,A3348897A,A3348960F,A3349023F,A3349086R,A3348582J,...,A3348585R,A3348651A,A3348714X,A3348777J,A3348840L,A3348903K,A3348966V,A3349029V,A3349092K,A3348588W
9,Apr-1982,1250.2,916.2,486.3,279.4,298.3,79.9,NaN,57.1,3396.4,...,3518.7,1310.3,933.2,511.5,284.0,315.3,81.3,NaN,57.3,3523.4

In [6]:
# Clean weekly earnings dataset (units are $ dollars)
#Remove unneccesary rows (0-8, second column, 5th column, 8th column)
weekly_earnings_cleaned = weekly_earnings_df.drop(weekly_earnings_df.index[0:9])
weekly_earnings_cleaned.head()

,Unnamed: 0,Earnings; Males; Full Time; Adult; Ordinary time earnings ; Western Australia ;,Earnings; Males; Full Time; Adult; Total earnings ; Western Australia ;,Earnings; Males; Total earnings ; Western Australia ;,Earnings; Females; Full Time; Adult; Ordinary time earnings ; Western Australia ;,Earnings; Females; Full Time; Adult; Total earnings ; Western Australia ;,Earnings; Females; Total earnings ; Western Australia ;,Earnings; Persons; Full Time; Adult; Ordinary time earnings ; Western Australia ;,Earnings; Persons; Full Time; Adult; Total earnings ; Western Australia ;,Earnings; Persons; Total earnings ; Western Australia ;
9,May-2012,1659.80,1826.70,1556.10,1241.90,1266.90,834.30,1516.80,1635.20,1204.50
10,Nov-2012,1746.70,1888.50,1614.90,1277.60,1298.90,847.30,1590.60,1692.40,1244.00
11,May-2013,1804.70,1935.70,1664.30,1325.50,1350.50,889.60,1644.80,1740.50,1297.90
12,Nov-2013,1754.10,1869.00,1619.20,1338.20,1363.00,917.10,1620.00,1705.90,1296.30
13,May-2014,1788.90,1919.70,1637.90,1336.30,1359.60,933.30,1641.20,1736.80,1314.30

In [7]:
#Remove 2nd, 5th, 8th columns
weekly_earnings_reduced = weekly_earnings_cleaned.drop(weekly_earnings_cleaned.columns[[1, 4, 7]], axis = 1)
weekly_earnings_reduced.head()

,Unnamed: 0,Earnings; Males; Full Time; Adult; Total earnings ; Western Australia ;,Earnings; Males; Total earnings ; Western Australia ;,Earnings; Females; Full Time; Adult; Total earnings ; Western Australia ;,Earnings; Females; Total earnings ; Western Australia ;,Earnings; Persons; Full Time; Adult; Total earnings ; Western Australia ;,Earnings; Persons; Total earnings ; Western Australia ;
9,May-2012,1826.70,1556.10,1266.90,834.30,1635.20,1204.50
10,Nov-2012,1888.50,1614.90,1298.90,847.30,1692.40,1244.00
11,May-2013,1935.70,1664.30,1350.50,889.60,1740.50,1297.90
12,Nov-2013,1869.00,1619.20,1363.00,917.10,1705.90,1296.30
13,May-2014,1919.70,1637.90,1359.60,933.30,1736.80,1314.30

In [8]:
#check what the current headings are for columns
weekly_earnings_reduced.columns

Index(['Unnamed: 0',
       'Earnings; Males; Full Time; Adult; Total earnings ;  Western Australia ;',
       'Earnings; Males; Total earnings ;  Western Australia ;',
       'Earnings; Females; Full Time; Adult; Total earnings ;  Western Australia ;',
       'Earnings; Females; Total earnings ;  Western Australia ;',
       'Earnings; Persons; Full Time; Adult; Total earnings ;  Western Australia ;',
       'Earnings; Persons; Total earnings ;  Western Australia ;'],
      dtype='object')

In [9]:
#Renaming Weekly Earnings Headings

weekly_earnings_reduced.columns = ['Date', 'Male_Earnings_Full_Time$', 'Male_Earnings_Total$', 
                                   'Female_Earnings_Full_Time$', 'Female_Earnings_Total$', 
                                   'People_Earnings_Full_Time$', 'People_Earnings_Total$']
weekly_earnings_reduced.head()

,Date,Male_Earnings_Full_Time$,Male_Earnings_Total$,Female_Earnings_Full_Time$,Female_Earnings_Total$,People_Earnings_Full_Time$,People_Earnings_Total$
9,May-2012,1826.70,1556.10,1266.90,834.30,1635.20,1204.50
10,Nov-2012,1888.50,1614.90,1298.90,847.30,1692.40,1244.00
11,May-2013,1935.70,1664.30,1350.50,889.60,1740.50,1297.90
12,Nov-2013,1869.00,1619.20,1363.00,917.10,1705.90,1296.30
13,May-2014,1919.70,1637.90,1359.60,933.30,1736.80,1314.30

In [10]:
labour_force_df.head(10)

,Unnamed: 0,Employed total ; Persons ;,Employed total ; Persons ;.1,Employed total ; Persons ;.2,Employed total ; > Males ;,Employed total ; > Males ;.1,Employed total ; > Males ;.2,Employed total ; > Females ;,Employed total ; > Females ;.1,Employed total ; > Females ;.2,...,Participation rate ; > Males ;.2,Participation rate ; > Females ;,Participation rate ; > Females ;.1,Participation rate ; > Females ;.2,Not in the labour force (NILF) ; Persons ;,Not in the labour force (NILF) ; > Males ;,Not in the labour force (NILF) ; > Females ;,Civilian population aged 15 years and over ; Persons ;,Civilian population aged 15 years and over ; > Males ;,Civilian population aged 15 years and over ; > Females ;
0,Unit,000,000,000,000,000,000,000,000,000,...,Percent,Percent,Percent,Percent,000,000,000,000,000,000
1,Series Type,Trend,Seasonally Adjusted,Original,Trend,Seasonally Adjusted,Original,Trend,Seasonally Adjusted,Original,...,Original,Trend,Seasonally Adjusted,Original,Original,Original,Original,Original,Original,Original
2,Data Type,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK,...,PERCENT,PERCENT,PERCENT,PERCENT,STOCK,STOCK,STOCK,STOCK,STOCK,STOCK
3,Frequency,Month,Month,Month,Month,Month,Month,Month,Month,Month,...,Month,Month,Month,Month,Month,Month,Month,Month,Month,Month
4,Collection Month,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
5,Series Start,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,...,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978,Feb-1978
6,Series End,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,...,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022
7,No. Obs,537,537,537,537,537,537,537,537,537,...,537,537,537,537,537,537,537,537,537,537
8,Series ID,A84423993J,A84423321T,A84423657W,A84423881R,A84423209T,A84423545C,A84424105T,A84423433K,A84423769R,...,A84423551X,A84424111L,A84423439X,A84423775K,A84423660K,A84423548K,A84423772C,A84423661L,A84423549L,A84423773F
9,Feb-1978,529.8,524.1,522.9,341.8,342.5,344.8,188.0,181.6,178.1,...,82.2,46.7,45.7,45.6,318.3,79.4,238.9,884.2,445.3,438.9

In [11]:
# remove unwanted rows (0-9)
labour_force_cleaned = labour_force_df.drop(labour_force_df.index[0:9])
labour_force_cleaned.head()

,Unnamed: 0,Employed total ; Persons ;,Employed total ; Persons ;.1,Employed total ; Persons ;.2,Employed total ; > Males ;,Employed total ; > Males ;.1,Employed total ; > Males ;.2,Employed total ; > Females ;,Employed total ; > Females ;.1,Employed total ; > Females ;.2,...,Participation rate ; > Males ;.2,Participation rate ; > Females ;,Participation rate ; > Females ;.1,Participation rate ; > Females ;.2,Not in the labour force (NILF) ; Persons ;,Not in the labour force (NILF) ; > Males ;,Not in the labour force (NILF) ; > Females ;,Civilian population aged 15 years and over ; Persons ;,Civilian population aged 15 years and over ; > Males ;,Civilian population aged 15 years and over ; > Females ;
9,Feb-1978,529.8,524.1,522.9,341.8,342.5,344.8,188.0,181.6,178.1,...,82.2,46.7,45.7,45.6,318.3,79.4,238.9,884.2,445.3,438.9
10,Mar-1978,529.5,529.4,530.7,341.4,341.4,344.1,188.1,188.0,186.6,...,81.0,46.7,46.2,46.3,321.3,84.7,236.6,886.7,446.5,440.2
11,Apr-1978,529.1,528.3,531.7,341.0,340.6,343.5,188.1,187.7,188.2,...,80.7,46.6,46.4,46.5,322.2,86.2,235.9,888.0,447.1,440.9
12,May-1978,528.6,528.9,532.5,340.7,340.6,342.6,187.9,188.2,189.9,...,80.2,46.4,46.6,46.8,323.8,88.7,235.0,889.6,447.9,441.7
13,Jun-1978,528.0,530.7,532.2,340.5,342.6,341.8,187.4,188.1,190.5,...,79.9,46.2,46.5,46.9,325.4,90.1,235.2,891.4,448.8,442.6

In [12]:
#keep certain columns(0, 2, 5, 8, 11, 14, 17) drop the rest
labour_force_reduced = labour_force_cleaned.iloc[:, [0,2,5,8,11,14,17]]
labour_force_reduced.head()

,Unnamed: 0,Employed total ; Persons ;.1,Employed total ; > Males ;.1,Employed total ; > Females ;.1,> Employed full-time ; Persons ;.1,> Employed full-time ; > Males ;.1,> Employed full-time ; > Females ;.1
9,Feb-1978,524.1,342.5,181.6,435.0,324.5,110.5
10,Mar-1978,529.4,341.4,188.0,436.3,322.9,113.4
11,Apr-1978,528.3,340.6,187.7,435.6,323.3,112.3
12,May-1978,528.9,340.6,188.2,435.4,323.7,111.7
13,Jun-1978,530.7,342.6,188.1,440.2,325.4,114.8

In [13]:
# rename the columns
labour_force_reduced.columns

Index(['Unnamed: 0', 'Employed total ;  Persons ;.1',
       'Employed total ;  > Males ;.1', 'Employed total ;  > Females ;.1',
       '> Employed full-time ;  Persons ;.1',
       '> Employed full-time ;  > Males ;.1',
       '> Employed full-time ;  > Females ;.1'],
      dtype='object')

In [14]:
#rename columns
labour_force_reduced.columns = ['Date', 'Employed Total Persons (000)', 'Employed Total Males (000)', 'Employed Total Females (000)', 
                                'Employed Full Time Persons (000)', 'Employed Full Time Males (000)', 'Employed Full Time Females(000)']
labour_force_reduced.head()

,Date,Employed Total Persons (000),Employed Total Males (000),Employed Total Females (000),Employed Full Time Persons (000),Employed Full Time Males (000),Employed Full Time Females(000)
9,Feb-1978,524.1,342.5,181.6,435.0,324.5,110.5
10,Mar-1978,529.4,341.4,188.0,436.3,322.9,113.4
11,Apr-1978,528.3,340.6,187.7,435.6,323.3,112.3
12,May-1978,528.9,340.6,188.2,435.4,323.7,111.7
13,Jun-1978,530.7,342.6,188.1,440.2,325.4,114.8

In [15]:
retail_turnover_df.head(10)

,Unnamed: 0,Turnover ; New South Wales ; Total (Industry) ;,Turnover ; Victoria ; Total (Industry) ;,Turnover ; Queensland ; Total (Industry) ;,Turnover ; South Australia ; Total (Industry) ;,Turnover ; Western Australia ; Total (Industry) ;,Turnover ; Tasmania ; Total (Industry) ;,Turnover ; Northern Territory ; Total (Industry) ;,Turnover ; Australian Capital Territory ; Total (Industry) ;,Turnover ; Total (State) ; Total (Industry) ;,...,Turnover ; Total (State) ; Total (Industry) ;.1,Turnover ; New South Wales ; Total (Industry) ;.2,Turnover ; Victoria ; Total (Industry) ;.2,Turnover ; Queensland ; Total (Industry) ;.2,Turnover ; South Australia ; Total (Industry) ;.2,Turnover ; Western Australia ; Total (Industry) ;.2,Turnover ; Tasmania ; Total (Industry) ;.2,Turnover ; Northern Territory ; Total (Industry) ;.2,Turnover ; Australian Capital Territory ; Total (Industry) ;.2,Turnover ; Total (State) ; Total (Industry) ;.2
0,Unit,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,...,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions,$ Millions
1,Series Type,Original,Original,Original,Original,Original,Original,Original,Original,Original,...,Seasonally Adjusted,Trend,Trend,Trend,Trend,Trend,Trend,Trend,Trend,Trend
2,Data Type,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,...,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW,FLOW
3,Frequency,Month,Month,Month,Month,Month,Month,Month,Month,Month,...,Month,Month,Month,Month,Month,Month,Month,Month,Month,Month
4,Collection Month,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
5,Series Start,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,...,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982,Apr-1982
6,Series End,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,...,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022,Oct-2022
7,No. Obs,487,487,487,487,487,487,487,487,487,...,487,487,487,487,487,487,487,487,487,487
8,Series ID,A3348645F,A3348708C,A3348771V,A3348834T,A3348897A,A3348960F,A3349023F,A3349086R,A3348582J,...,A3348585R,A3348651A,A3348714X,A3348777J,A3348840L,A3348903K,A3348966V,A3349029V,A3349092K,A3348588W
9,Apr-1982,1250.2,916.2,486.3,279.4,298.3,79.9,NaN,57.1,3396.4,...,3518.7,1310.3,933.2,511.5,284.0,315.3,81.3,NaN,57.3,3523.4

In [16]:
# remove unwanted rows (0-9)
retail_turnover_cleaned = retail_turnover_df.drop(retail_turnover_df.index[0:9])
retail_turnover_cleaned.head()

,Unnamed: 0,Turnover ; New South Wales ; Total (Industry) ;,Turnover ; Victoria ; Total (Industry) ;,Turnover ; Queensland ; Total (Industry) ;,Turnover ; South Australia ; Total (Industry) ;,Turnover ; Western Australia ; Total (Industry) ;,Turnover ; Tasmania ; Total (Industry) ;,Turnover ; Northern Territory ; Total (Industry) ;,Turnover ; Australian Capital Territory ; Total (Industry) ;,Turnover ; Total (State) ; Total (Industry) ;,...,Turnover ; Total (State) ; Total (Industry) ;.1,Turnover ; New South Wales ; Total (Industry) ;.2,Turnover ; Victoria ; Total (Industry) ;.2,Turnover ; Queensland ; Total (Industry) ;.2,Turnover ; South Australia ; Total (Industry) ;.2,Turnover ; Western Australia ; Total (Industry) ;.2,Turnover ; Tasmania ; Total (Industry) ;.2,Turnover ; Northern Territory ; Total (Industry) ;.2,Turnover ; Australian Capital Territory ; Total (Industry) ;.2,Turnover ; Total (State) ; Total (Industry) ;.2
9,Apr-1982,1250.2,916.2,486.3,279.4,298.3,79.9,NaN,57.1,3396.4,...,3518.7,1310.3,933.2,511.5,284.0,315.3,81.3,NaN,57.3,3523.4
10,May-1982,1300.0,931.2,492.8,288.0,318.5,78.9,NaN,57.3,3497.9,...,3527.7,1307.4,939.0,513.4,287.6,316.5,81.5,NaN,57.4,3533.6
11,Jun-1982,1234.2,887.0,494.1,277.2,301.5,77.5,NaN,55.3,3357.8,...,3561.5,1305.2,946.3,515.5,291.8,317.8,81.9,NaN,57.7,3547.0
12,Jul-1982,1265.0,921.3,515.6,296.1,316.4,82.7,NaN,56.3,3486.8,...,3553.9,1302.5,954.3,517.1,296.3,319.1,82.2,NaN,58.2,3560.6
13,Aug-1982,1217.6,883.2,501.4,288.4,300.5,78.1,NaN,55.4,3355.9,...,3581.8,1298.2,963.6,517.9,301.1,320.4,82.4,NaN,58.9,3573.6

In [17]:
#Filter data to keep two columns(0, 14)
retail_turnover_reduced = retail_turnover_cleaned.iloc[:, [0,14]]
retail_turnover_reduced.head()

   Unnamed: 0 Turnover ;  Western Australia ;  Total (Industry) ;.1
9    Apr-1982                                              313.0
10   May-1982                                              315.5
11   Jun-1982                                              321.2
12   Jul-1982                                              320.4
13   Aug-1982                                              318.5

In [18]:
#rename headers
retail_turnover_reduced.columns = ['Date', 'Retail Turnover WA ($ millions)']
retail_turnover_reduced.head()

        Date Retail Turnover WA ($ millions)
9   Apr-1982                           313.0
10  May-1982                           315.5
11  Jun-1982                           321.2
12  Jul-1982                           320.4
13  Aug-1982                           318.5

In [19]:
retail_turnover_reduced.dtypes

Date                               object
Retail Turnover WA ($ millions)    object
dtype: object

In [20]:
# unnecessary cell - keep for syntax notes only
# new_df = retail_turnover_reduced.loc[(retail_turnover_reduced["Date"] == "May-2021")|( 
#                                      retail_turnover_reduced["Date"] =="Nov-2021")|(retail_turnover_reduced["Date"] == "May-2021"),:]
# new_df.head()

In [21]:
df = pd.merge(weekly_earnings_reduced, labour_force_reduced, on='Date', how='inner')
df

,Date,Male_Earnings_Full_Time$,Male_Earnings_Total$,Female_Earnings_Full_Time$,Female_Earnings_Total$,People_Earnings_Full_Time$,People_Earnings_Total$,Employed Total Persons (000),Employed Total Males (000),Employed Total Females (000),Employed Full Time Persons (000),Employed Full Time Males (000),Employed Full Time Females(000)
0,May-2012,1826.70,1556.10,1266.90,834.30,1635.20,1204.50,1300.3,728.0,572.4,941.2,633.5,307.7
1,Nov-2012,1888.50,1614.90,1298.90,847.30,1692.40,1244.00,1314.3,729.2,585.2,951.2,631.8,319.5
2,May-2013,1935.70,1664.30,1350.50,889.60,1740.50,1297.90,1298.0,730.8,567.2,936.7,630.2,306.6
3,Nov-2013,1869.00,1619.20,1363.00,917.10,1705.90,1296.30,1306.2,732.1,574.1,928.5,618.8,309.6
4,May-2014,1919.70,1637.90,1359.60,933.30,1736.80,1314.30,1305.6,729.2,576.4,924.7,617.0,307.6
5,Nov-2014,1989.20,1686.60,1389.90,953.80,1792.90,1346.70,1323.6,737.3,586.3,944.6,635.1,309.4
6,May-2015,1987.80,1682.70,1395.90,955.30,1784.80,1340.00,1334.0,736.3,597.8,942.0,617.2,324.8
7,Nov-2015,1993.80,1633.10,1429.40,964.10,1806.00,1326.80,1309.2,724.7,584.5,907.1,608.6,298.5
8,May-2016,1976.80,1635.70,1422.80,944.30,1795.30,1319.70,1311.9,712.9,599.1,878.9,588.9,290.0
9,Nov-2016,1989.60,1637.70,1432.50,982.80,1798.50,1327.60,1296.2,703.4,592.8,875.4,578.4,297.0
10,May-2017,1965.70,1637.20,1450.00,978.00,1795.50,1333.20,1319.0,716.9,602.1,903.1,589.8,313.3
11,Nov-2017,1996.20,1654.80,1477.10,975.30,1824.80,1332.50,1327.7,718.2,609.5,900.5,587.1,313.4
12,May-2018,1996.30,1642.90,1481.50,967.70,1820.90,1320.40,1340.2,723.9,616.3,907.6,598.8,308.8
13,Nov-2018,2040.00,1640.70,1495.30,965.90,1845.10,1299.30,1346.1,729.7,616.4,936.1,614.1,322.0
14,May-2019,2030.50,1643.70,1528.30,962.20,1858.10,1311.00,1348.3,728.9,619.4,925.7,601.2,324.5
15,Nov-2019,2042.20,1691.40,1515.80,988.30,1858.60,1334.90,1364.1,734.7,629.4,924.6,599.2,325.4
16,May-2020,2092.60,1726.70,1567.00,1064.50,1910.60,1409.40,1282.5,697.5,584.9,901.3,585.7,315.6
17,Nov-2020,2085.50,1724.30,1563.50,1001.60,1908.00,1362.20,1378.6,738.0,640.5,918.3,608.7,309.7
18,May-2021,2138.10,1781.50,1613.00,1055.70,1961.50,1438.80,1395.0,740.6,654.4,916.7,600.3,316.4
19,Nov-2021,2159.00,1809.20,1639.00,1061.10,1979.20,1432.90,1448.6,770.4,678.2,974.3,626.8,347.5
20,May-2022,2201.90,1810.50,1660.90,1139.70,2011.80,1491.50,1472.7,786.6,686.1,1015.2,651.0,364.3

In [22]:
df.count()

Date                                21
Male_Earnings_Full_Time$            21
Male_Earnings_Total$                21
Female_Earnings_Full_Time$          21
Female_Earnings_Total$              21
People_Earnings_Full_Time$          21
People_Earnings_Total$              21
Employed Total Persons (000)        21
Employed Total Males (000)          21
Employed Total Females (000)        21
Employed Full Time Persons (000)    21
Employed Full Time Males (000)      21
Employed Full Time Females(000)     21
dtype: int64

In [23]:
final_df = pd.merge(df, retail_turnover_reduced, on='Date', how='inner')
final_df.head()

,Date,Male_Earnings_Full_Time$,Male_Earnings_Total$,Female_Earnings_Full_Time$,Female_Earnings_Total$,People_Earnings_Full_Time$,People_Earnings_Total$,Employed Total Persons (000),Employed Total Males (000),Employed Total Females (000),Employed Full Time Persons (000),Employed Full Time Males (000),Employed Full Time Females(000),Retail Turnover WA ($ millions)
0,May-2012,1826.70,1556.10,1266.90,834.30,1635.20,1204.50,1300.3,728.0,572.4,941.2,633.5,307.7,2589.8
1,Nov-2012,1888.50,1614.90,1298.90,847.30,1692.40,1244.00,1314.3,729.2,585.2,951.2,631.8,319.5,2652.7
2,May-2013,1935.70,1664.30,1350.50,889.60,1740.50,1297.90,1298.0,730.8,567.2,936.7,630.2,306.6,2705.4
3,Nov-2013,1869.00,1619.20,1363.00,917.10,1705.90,1296.30,1306.2,732.1,574.1,928.5,618.8,309.6,2725.6
4,May-2014,1919.70,1637.90,1359.60,933.30,1736.80,1314.30,1305.6,729.2,576.4,924.7,617.0,307.6,2706.0

## Load
### Connect to local database

In [24]:
protocol = 'postgresql'
username = 'postgres'
password = 3720
host = 'localhost'
port = 5432
database_name = 'Final_db'
rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
engine = create_engine(rds_connection_string)
insp = inspect(engine)

 ### Check for tables

In [25]:
insp.get_table_names()

['weekly_earnings', 'Labour_Force', 'retail_turnover', 'Retail_Turnover']

### Use pandas to load csv converted DataFrame into database
* NOTE: can also check using pgAdmin

In [26]:
# load weekly earnings dataset into database
weekly_earnings_reduced.to_sql(name='Weekly_Earnings', con=engine, if_exists='append', index=False)

In [27]:
# load labour force dataset into database
labour_force_reduced.to_sql(name='Labour_Force', con=engine, if_exists='append', index=False)

In [28]:
# load retail turnover dataset into database
retail_turnover_reduced.to_sql(name='Retail_Turnover', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_location table

In [29]:
# Confirm data has been added by querying the weekly earnings table  
pd.read_sql_query('select * from Weekly_Earnings', con=engine).head()

Empty DataFrame
Columns: [id, date, male_earnings_full_time$, male_earnings_total$, female_earnings_full_time$, female_earnings_total$, people_earnings_full_time$, people_earnings_total$]
Index: []

In [36]:
# Confirm data has been added by querying the labour force table  
pd.read_sql_query('select * from Labour_Force', con=engine).head()

Empty DataFrame
Columns: [id, date, employed_total_persons_000, employed_total_males_000, employed_total_females_000, employed_full_time_persons_000, employed_full_time_males_000, employed_full_time_females_000]
Index: []

In [37]:
# Confirm data has been added by querying the Retail turnover table  
pd.read_sql_query('select * from Retail_Turnover', con=engine).head()

Empty DataFrame
Columns: [id, date, retail_turnover_wa]
Index: []

In [46]:
# join the tables
sql_join = r"""SELECT Weekly_Earnings.date, Weekly_Earnings.male_earnings_full_time$,

Weekly_Earnings.male_earnings_total$,Labour_Force.employed_total_males_000,Labour_Force.employed_full_time_males_000,
Weekly_Earnings.female_earnings_full_time$,Weekly_Earnings.female_earnings_total$, Labour_Force.employed_total_females_000,
Labour_Force.employed_full_time_females_000,
Weekly_Earnings.people_earnings_full_time$, Weekly_Earnings.people_earnings_total$,
Labour_Force.employed_total_persons_000, 
Labour_Force.employed_full_time_persons_000



FROM Weekly_Earnings
JOIN Labour_Force

ON Weekly_Earnings.date = Labour_Force.date"""
pd.read_sql_query(sql_join, con=engine).head()

Empty DataFrame
Columns: [date, male_earnings_full_time$, male_earnings_total$, employed_total_males_000, employed_full_time_males_000, female_earnings_full_time$, female_earnings_total$, employed_total_females_000, employed_full_time_females_000, people_earnings_full_time$, people_earnings_total$, employed_total_persons_000, employed_full_time_persons_000]
Index: []